cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/dupes' # https://github.com/Homebrew/homebrew-dupes

# GNU Command Line Tools
brew 'ack' # http://brewformulas.org/Ack
brew 'coreutils' 
brew 'binutils'
brew 'diffutils' 
brew 'findutils'
brew 'wget'
brew 'grep', args: ['with-default-names']
brew 'gzip'

# GNU Command Line Tools: Newer versions
brew 'bash'
brew 'emacs'
brew 'less'
brew 'make'
brew 'nano'

# Complementary packages, the following ones are not from GNU, but you can install and use a newer version instead of the version shipped by OS X:
brew 'file-formula'
brew 'git'
brew 'openssh'
brew 'python'
brew 'rsync'
#brew 'rsnapshot'
brew 'svn'
brew 'unzip'

# Others
brew 'imagemagick'
brew 'openssl'
brew 'node'
brew 'spark' # http://brewformulas.org/Spark
brew 'yarn'
brew 'unrar'
brew 'blackbox' # https://github.com/StackExchange/blackbox
brew 'tree'

# Terminal
brew 'zsh'
brew 'liquidprompt'  # https://github.com/nojhan/liquidprompt

# My App List (Install with brew/cask)
cask 'hyper' # hyper.is
cask '1password' # https://1password.com/
cask 'dropbox' # https://dropbox.com
cask 'totalfinder' # https://totalfinder.binaryage.com
cask 'sublime-text' # sublimetext.com
cask 'atom' # https://atom.io
cask 'firefox' # https://mozilla.org/firefox
cask 'google-chrome' # chrome.com
cask 'slack' # https://slack.com
cask 'transmission' # https://transmissionbt.com
cask 'tunnelbear' # https://tunnelbear.com
cask 'vlc' # videolan.org/vlc/
cask 'flux' # https://justgetflux.com
cask 'sequel-pro' # sequelpro.com
cask 'spamsieve' # http://c-command.com/spamsieve/
cask 'appcleaner' # http://freemacsoft.net/appcleaner/
cask 'carbon-copy-cloner' # http://bombich.com/